In [1]:
g = lambda x: x**2

In [2]:
g(8)

64

In [4]:
def even(x):
    if x%2==0:
        return True
    else:
        return False
m = list(filter(even,range(0,30)))

In [5]:
m[10]

20

In [10]:
def square(x): 
    return x**2
list(map(square, range(0,5)))

[0, 1, 4, 9, 16]

In [8]:
def expo(x, y):
    return x**y

list (map(expo, range(0,5), range(0,5)))

[1, 1, 4, 27, 256]

In [16]:
import functools

def fact(x, y): 
    return x*y 

print(functools.reduce(fact, range(2,5)))

24

In [17]:
list(map(lambda x: x**2, range(0,11)))

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [27]:
#mylist1 = [] # Creates an empty list 
#mylist2 = [expression1, expression2, ...] 
#mylist3 = [expression for variable in sequence]

#Example:
mylist2 = [0,1,4,9,16] 
mylist3 = [i*i for i in range(5)]

In [28]:
mylist3

[0, 1, 4, 9, 16]

In [30]:
# mylist1 and mylist2 point to the same list 
mylist1 = mylist2 = []

# mylist3 and mylist4 point to the same list 
mylist3 = [] 
mylist4 = mylist3 

mylist5 = []; mylist6 = [] # different lists

In [31]:
#mencari nilia pada index ke-2
mylist = [34,67,45,29] 
mylist[2]

45

In [33]:
mylist[3]

29

In [38]:
#mencari index ke berapa
mylist = [34,67,45,29]
mylist.index(29)

3

In [50]:
#mylist[start:end] # items start to end-1 
#mylist[start:] # items start to end of the array 
#mylist[:end] # items from beginning to end-1 
#mylist[:] # a copy of the whole array

#mylist[start:end:step] # start to end-1, by step

mylist = [34, 56, 29, 73, 19, 62] 
mylist[2:3]

[29]

In [51]:
mylist[1:]

[56, 29, 73, 19, 62]

In [52]:
mylist[:2]

[34, 56]

In [53]:
mylist[:]

[34, 56, 29, 73, 19, 62]

In [54]:
mylist[0:3:2]

[34, 29]

In [63]:
#inserting/removing
mylist = [34, 56, 29, 73, 19, 62]
mylist.append(47)
mylist

[34, 56, 29, 73, 19, 62, 47]

In [64]:
mylist = [34, 56, 29, 73, 19, 62]
mylist.extend([47,81])
mylist

[34, 56, 29, 73, 19, 62, 47, 81]

In [65]:
mylist = [34, 56, 29, 73, 19, 62]
mylist.insert(2,47) 
mylist

[34, 56, 47, 29, 73, 19, 62]

In [66]:
mylist = [34, 56, 29, 73, 19, 62]
mylist.remove(29) 
mylist

[34, 56, 73, 19, 62]

In [84]:
stack = [34, 56, 29, 73, 19, 62]
stack.append(47)
stack

[34, 56, 29, 73, 19, 62, 47]

In [85]:
#POP (kaya konsep antrian pada pengiriman barang[terakhir masuk, tetapi pertama keluar])
#mengambil array terakhir
stack.pop()

47

In [86]:
stack

[34, 56, 29, 73, 19, 62]

In [95]:
from collections import deque 
queue = deque([35, 19, 67])
queue.append(42) 
queue.append(23) 
queue

deque([35, 19, 67, 42, 23])

In [96]:
#mengambil array pertama

queue.popleft()

35

In [97]:
queue.popleft()

19

In [98]:
queue

deque([67, 42, 23])

In [104]:
#berapa banyak huruf 'a'

mylist = ['a', 'b', 'c', 'd', 'a', 'f', 'c'] 
mylist.count('a')

2

In [105]:
#mengatur data yang acak kadul

mylist = [5, 2, 3, 4, 1] 
mylist.sort()
mylist

[1, 2, 3, 4, 5]

In [106]:
mylist.reverse() 
mylist

[5, 4, 3, 2, 1]

In [115]:
mylist = ['b', 'A', 'D', 'c'] 
mylist.sort(key = str.lower) 
mylist

['A', 'b', 'c', 'D']

In [125]:
mylist = ['b', 'A', 'D', 'c'] 
mylist.sort(key = str.lower, reverse = True) 
mylist

['D', 'c', 'b', 'A']

In [138]:
myset = set() 
myset2 = set([]) # both are empty sets

In [159]:
myset = {x for x in 'acbrdf'}

In [160]:
myset

{'a', 'b', 'c', 'd', 'f', 'r'}

In [161]:
myset.add('y')

In [162]:
myset

{'a', 'b', 'c', 'd', 'f', 'r', 'y'}

In [163]:
myset.remove('a')

In [164]:
myset

{'b', 'c', 'd', 'f', 'r', 'y'}

In [165]:
myset.pop()

'd'

In [166]:
myset

{'b', 'c', 'f', 'r', 'y'}

In [184]:
s1 = set('abracadabra') 
s2 = set('alacazam') 
s1

{'a', 'b', 'c', 'd', 'r'}

In [185]:
s2

{'a', 'c', 'l', 'm', 'z'}

In [186]:
s1 |= s2

In [187]:
s1

{'a', 'b', 'c', 'd', 'l', 'm', 'r', 'z'}

In [188]:
s1 = set('abracadabra') 
s2 = set('alacazam') 
s1 &= s2 
s1

{'a', 'c'}

In [189]:
s1 = set('abracadabra') 
s2 = set('alacazam') 
s1 ^= s2
s1

{'b', 'd', 'l', 'm', 'r', 'z'}

In [190]:
s1 = set('abracadabra') 
s2 = set('alacazam') 
s1 >= s2

False

In [191]:
s1 = set('abracadabra') 
s2 = set('alacazam') 
s1 > s2

False

In [192]:
s1 = set('abracadabra') 
s2 = set('alacazam') 
s1 <= s2

False

In [193]:
t1 = (1, 2, 3, 4) 
t2 = "a", "b", "c", "d" 
t3 = () 
t4 = ("red", )

In [196]:
s = "Susan", 19, "CS" # tuple packing 
name, age, major = s # tuple unpacking 
name

'Susan'

In [197]:
age

19

In [198]:
major

'CS'

In [199]:
d1 = {} 
d2 = dict() # both empty 
d3 = {"Name": "Susan", "Age": 19, "Major": "CS"} 
d4 = dict(Name="Susan", Age=19, Major="CS") 
d5 = dict(zip(['Name', 'Age', 'Major'], ["Susan", 19, "CS"])) 
d6 = dict([('Age', 19), ('Name', "Susan"), ('Major', "CS")])

In [200]:
d1 = {'Age':19, 'Name':"Susan", 'Major':"CS"} 
d1['Age']

19

In [201]:
d1["Name"]

'Susan'

In [202]:
#Updating

d1 = {'Age':19, 'Name':"Susan", 'Major':"CS"} 
d1['Age'] = 21 
d1['Year'] = "Junior" 
d1

{'Age': 21, 'Major': 'CS', 'Name': 'Susan', 'Year': 'Junior'}

In [203]:
del d1["Major"]

In [204]:
d1

{'Age': 21, 'Name': 'Susan', 'Year': 'Junior'}

In [205]:
d1.clear()

In [206]:
d1

{}

In [224]:
#Built-in

d1 = {'Age':19, 'Name':"Susan", 'Major':"CS"}

In [222]:
d1.keys() # Return a list of keys

dict_keys(['Age', 'Major', 'Name'])

In [211]:
 d1.items() # Return a list of key:value pairs

dict_items([('Age', 19), ('Major', 'CS'), ('Name', 'Susan')])

In [212]:
d1.values() # Returns a list of values

dict_values([19, 'CS', 'Susan'])

In [225]:
#ORDERED

#OrderedDict.popitem(last=True)  # pops items in LIFO order

In [231]:
# regular unsorted dictionary 
d = {'banana': 3, 'apple': 4, 'pear': 5, 'orange': 2} 

# dictionary sorted by key 
from collections import OrderedDict

In [235]:
OrderedDict(sorted(d.items(), key=lambda t: t[0]))

OrderedDict([('apple', 4), ('banana', 3), ('orange', 2), ('pear', 5)])

In [236]:
# dictionary sorted by value 
OrderedDict(sorted(d.items(), key=lambda t: t[1]))

OrderedDict([('orange', 2), ('banana', 3), ('apple', 4), ('pear', 5)])

In [237]:
# dictionary sorted by length of the key string 
OrderedDict(sorted(d.items(), key=lambda t: len(t[0])))

OrderedDict([('pear', 5), ('apple', 4), ('banana', 3), ('orange', 2)])

In [240]:
#Import Python Libraries 
import numpy as np 
import scipy as sp 
import pandas as pd 
import matplotlib as mpl 
import seaborn as sns

In [241]:
#Read csv file 
df = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [317]:
df.head

<bound method NDFrame.head of          rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
5        Prof          A   20       20    Male  122400
6   AssocProf          A   20       17    Male   81285
7        Prof          A   18       18    Male  126300
8        Prof          A   29       19    Male   94350
9        Prof          A   51       51    Male   57800
10       Prof          B   39       33    Male  128250
11       Prof          B   23       23    Male  134778
12   AsstProf          B    1        0    Male   88000
13       Prof          B   35       33    Male  162200
14       Prof          B   25       19    Male  153750
15       Prof          B   17        3    Male  150480
16   AsstProf          B    8        3    Male   75044
17   AsstProf          B    4        0    Male   92000
18       Prof          A   19        7    Male  107300
19       Prof          A   29       27    Male  150500
20   AsstProf          B    4        4    Male   92000
21       Prof          A   33       30    Male  103106
22   AsstProf          A    4        2    Male   73000
23   AsstProf          A    2        0    Male   85000
24       Prof          A   30       23    Male   91100
25       Prof          B   35       31    Male   99418
26       Prof          A   38       19    Male  148750
27       Prof          A   45       43    Male  155865
28   AsstProf          B    7        2    Male   91300
29       Prof          B   21       20    Male  123683
..        ...        ...  ...      ...     ...     ...
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]>

In [316]:
#List first 5 records 
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [280]:
#Check a particular column type 
df['salary'].dtype

dtype('int64')

In [281]:
 #Check types for all the columns 
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [292]:
#Group data using rank 
df_rank = df.groupby(['rank'])

In [293]:
#Calculate mean value for each numeric column per each group 
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [294]:
#Calculate mean salary for each professor rank: 
df.groupby('rank')[['salary']].mean()

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

In [295]:
 #Calculate mean salary for each professor rank: 
df.groupby(['rank'], sort=False)[['salary']].mean()

                  salary
rank
Prof       123624.804348
AssocProf   91786.230769
AsstProf    81362.789474

In [286]:
 #Calculate mean salary for each professor rank: 
df_sub = df[ df['salary'] > 120000 ]

In [296]:
#Select only those rows that contain female professors: 
df_f = df[ df['rank'] == 'Female' ]

In [297]:
  #Select column salary: 
df['salary']

0     186960
1      93000
2     110515
3     131205
4     104800
5     122400
6      81285
7     126300
8      94350
9      57800
10    128250
11    134778
12     88000
13    162200
14    153750
15    150480
16     75044
17     92000
18    107300
19    150500
20     92000
21    103106
22     73000
23     85000
24     91100
25     99418
26    148750
27    155865
28     91300
29    123683
       ...
48    111512
49    122960
50     97032
51    127512
52    105000
53     73500
54     62884
55     72500
56     77500
57     72500
58    144651
59    103994
60     92000
61    103750
62    109650
63     91000
64     73300
65    117555
66     63100
67     90450
68     77500
69    116450
70     78500
71     71065
72    161101
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [289]:
#Select column salary: 
df[['rank','salary']]

         rank  salary
0        Prof  186960
1        Prof   93000
2        Prof  110515
3        Prof  131205
4        Prof  104800
5        Prof  122400
6   AssocProf   81285
7        Prof  126300
8        Prof   94350
9        Prof   57800
10       Prof  128250
11       Prof  134778
12   AsstProf   88000
13       Prof  162200
14       Prof  153750
15       Prof  150480
16   AsstProf   75044
17   AsstProf   92000
18       Prof  107300
19       Prof  150500
20   AsstProf   92000
21       Prof  103106
22   AsstProf   73000
23   AsstProf   85000
24       Prof   91100
25       Prof   99418
26       Prof  148750
27       Prof  155865
28   AsstProf   91300
29       Prof  123683
..        ...     ...
48       Prof  111512
49       Prof  122960
50   AsstProf   97032
51       Prof  127512
52       Prof  105000
53   AsstProf   73500
54  AssocProf   62884
55   AsstProf   72500
56  AssocProf   77500
57   AsstProf   72500
58       Prof  144651
59  AssocProf  103994
60   AsstProf   92000
61  AssocProf  103750
62  AssocProf  109650
63       Prof   91000
64  AssocProf   73300
65       Prof  117555
66   AsstProf   63100
67       Prof   90450
68   AsstProf   77500
69       Prof  116450
70   AsstProf   78500
71  AssocProf   71065
72       Prof  161101
73       Prof  105450
74  AssocProf  104542
75       Prof  124312
76       Prof  109954
77       Prof  109646

[78 rows x 2 columns]

In [290]:
#Select rows by their position: 
df[10:20]

        rank discipline  phd  service   sex  salary
10      Prof          B   39       33  Male  128250
11      Prof          B   23       23  Male  134778
12  AsstProf          B    1        0  Male   88000
13      Prof          B   35       33  Male  162200
14      Prof          B   25       19  Male  153750
15      Prof          B   17        3  Male  150480
16  AsstProf          B    8        3  Male   75044
17  AsstProf          B    4        0  Male   92000
18      Prof          A   19        7  Male  107300
19      Prof          A   29       27  Male  150500

In [314]:
#Select rows by their labels: 
df_sub.loc[10:20,['rank','sex','salary']]

    rank   sex  salary
10  Prof  Male  128250
11  Prof  Male  134778
13  Prof  Male  162200
14  Prof  Male  153750
15  Prof  Male  150480
19  Prof  Male  150500

In [308]:
 #Select rows by their labels: 
df_sub.iloc[10:20,[1, 3, 4, 5]]

   discipline  service     sex  salary
26          A       19    Male  148750
27          A       43    Male  155865
29          B       20    Male  123683
31          B       21    Male  155750
35          B       23    Male  126933
36          B       45    Male  146856
39          B       18  Female  129000
40          A       36  Female  137000
44          B       19  Female  151768
45          B       25  Female  140096

In [299]:
#List first 5 records 
df.head(50)

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
5        Prof          A   20       20    Male  122400
6   AssocProf          A   20       17    Male   81285
7        Prof          A   18       18    Male  126300
8        Prof          A   29       19    Male   94350
9        Prof          A   51       51    Male   57800
10       Prof          B   39       33    Male  128250
11       Prof          B   23       23    Male  134778
12   AsstProf          B    1        0    Male   88000
13       Prof          B   35       33    Male  162200
14       Prof          B   25       19    Male  153750
15       Prof          B   17        3    Male  150480
16   AsstProf          B    8        3    Male   75044
17   AsstProf          B    4        0    Male   92000
18       Prof          A   19        7    Male  107300
19       Prof          A   29       27    Male  150500
20   AsstProf          B    4        4    Male   92000
21       Prof          A   33       30    Male  103106
22   AsstProf          A    4        2    Male   73000
23   AsstProf          A    2        0    Male   85000
24       Prof          A   30       23    Male   91100
25       Prof          B   35       31    Male   99418
26       Prof          A   38       19    Male  148750
27       Prof          A   45       43    Male  155865
28   AsstProf          B    7        2    Male   91300
29       Prof          B   21       20    Male  123683
30  AssocProf          B    9        7    Male  107008
31       Prof          B   22       21    Male  155750
32       Prof          A   27       19    Male  103275
33       Prof          B   18       18    Male  120000
34  AssocProf          B   12        8    Male  119800
35       Prof          B   28       23    Male  126933
36       Prof          B   45       45    Male  146856
37       Prof          A   20        8    Male  102000
38   AsstProf          B    4        3    Male   91000
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960

In [323]:
df.groupby('rank')[['salary']].max()

           salary
rank
AssocProf  119800
AsstProf    97032
Prof       186960

In [325]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [326]:
df[5:10]

        rank discipline  phd  service   sex  salary
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [327]:
df_sub.loc[5:10,['rank','sex','salary']]

    rank   sex  salary
5   Prof  Male  122400
7   Prof  Male  126300
10  Prof  Male  128250

In [330]:
df_sub.iloc[0:5,[0, 3, 4, 5]]

    rank  service   sex  salary
0   Prof       49  Male  186960
3   Prof       31  Male  131205
5   Prof       20  Male  122400
7   Prof       18  Male  126300
10  Prof       33  Male  128250

In [331]:
#Sorting

 # Create a new data frame from the original sorted by the column Salary 
    df_sorted = df.sort_values( by ='service') 
    df_sorted.head()

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

In [ ]:
df_sorted = df.sort_values( by =['service', 'salary'], ascending = [True, False]) df_sorted.head(10)

In [ ]:
 # Read a dataset with missing values 
flights = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/flights.csv")

In [ ]:
# Select the rows that have at least one missing value 
flights[flights.isnull().any(axis=1)].head()